Repository: gryphc/kiwitrees
Catalog: modules_v3/fancy_treeview/language/*.po
Languages: ar

source: <p>Currently the PDF option is only supported for LTR-languages. These are all languages in which the text is read from left to right. The PDF icon will be disabled when the user selects a RTL-language. In a RTL language the text is read from right to left.</p>
ar: <p>في الوقت الحالي خيار تكوين PDF متوفر للغات التي تكتب من اليسار الى اليمين فقط. خيار تكوين الملف سيكون معطلا لمستخدمي اللغات التي تكتب من اليمين الى اليسار.</p>

source: <p>Here you can enter a surname. The script will automatically search for the oldest person with this surname.</p><p>This person will act as the root person for this family branch. Potential you can perform a phonetic search by placing a check mark in one or both phonetic algorithms.</p><p>After the search is complete, it is possible to change the ID of the root person. You can enter as much surnames as you like. There will be a menu-link and page created for each surname.</p><p>By dragging and dropping the table entries which will appear after you have set the first surname, you can sort the pages in any way you want.</p>
ar: <p>هنا يمكنك ادخال اسم العائلة فقط والتطبيق سيقوم بالبحث عن اكبر شخص متوفر فيها واستخدامه كرأس لشجرة.</p><p>بعد انتهاء البحث يمكن تغيير الشحص الرأس من خلال تغيير رقم المعرف ID الخاص بة.</p><p>يمكن اضافه اكثر من اسم ايضا ويمكن ترتيبهم بأستخدام السحب والافلات.</p>

source: <p>The displayed surname is the surname used in the menu. It is possible to change the displayed surname to a more appropriate name.</p><p>If you click on the surname, an “edit”-field appears where you can change the surname. Click on the “save” button to save your input.</p><p>Note: this option is not available when the option “%s” is checked.</p>
ar: <p>اسم العائلة المستخدم هو الاسم الظهار في القائمة الرئيسية. يمكن تغييره الى اي اسم اخر.</p> <p>عند الضغط على اسم العائلة، سيظهر حقل تعديل وهنا يمكنك تغيير اسم العائلة، بعد تغييره تحتاج للضغط على حفظ.</p> <p>ملاحظة: هذا الخيار غير متوفر في حالة تغعيل خيار “%s” ادناه.</p>

source: <p>This option is especially usefull for large trees. When you notice a slow page load, here you can set the number of generation blocks to load at once to a lower level.</p><p>Below the last generation block a button will appear to add the next set of generation blocks. The new blocks will be added to the blocks already loaded.</p><p>Clicking on a “follow” link in the last visible generation block, will also load the next set of generation blocks.</p>
ar: <p>هذا الخيار مفيد للمشجرات الكبيرة خصوصا، في حالة ملاحظة بطئ في تحميل الشجرة يمكن استخدام هذا الخيار،</p><p>حيث يتيح هذا الخيار امكانية تحديد عدد الاجيال التي ستظهر في كل مرة وصولا الى اخر جيل.</p><p>في حالة اختيار عدد محدد فسيظهر زر "لاحق" في الاسفل وعند ضغطه سيتم تحميل واظهار نفس العدد المحدد من الاجيال حتى في كل مره.</p>

source: <p>Turn this option on if you want to show single persons in the generation blocks. Single persons are persons without partner and children.</p><p>With this option turned on, every child of a family will be shown in a detailed way in the next generation block.</p>
ar: <p>فعل هذا الخيار لاجل اظهار الاشخاص الغير مرتبطين في كل جيل. الاشخاص الغير متبطين هم اشخاص لم يذكر ابائهم واولادهم.</p> <p>عند تفعيل هذا الخيار سيظهر كل ابناء العائلة مع تفاصيلهم في حقل الجيل اللاحق.</p>

source: <p>With this option turned on, the script checks if a (married) couple has the same ancestors.</p><p>If a relationship between the partners is found, a text will appear between brackets after the spouses’ name to indicate the relationship.</p><p>Note: this option can cause slower page loading, especially on large trees. If you notice such a behavior, reduce the number of generation blocks to load at once (see the previous option).</p>
ar: <p>عند تفعيل هذا الخيار، سيقوم البرنامج بفحص اسلاف كل زوجين</p><p>وفي حاله وجود قرابه بينهم حيثث سيتم تأشير ذالك بين قوسين</p><p>ملاحظه: هذا الخيار يمكن ان يؤثر على سرعة التطبيق خصوصا في المشجرات الكبيرة، في حالهة ملاحظه مثل هكذا اسم استخد الخيار اعلاه لتقليل عدد الاجيال المحمله مسبقا.</p>

source: Add a surname
ar: أضافه اسم عائلة

source: Change root person
ar: تغيير الشخص الرئيسي

source: Check relationship between partners
ar: أفحص العلاقه بين الشركاء

source: Descendants of the %s family
ar: أحفاد عائلة %s

source: Edit Root person
ar: تعديل الشخص الرئيسي

source: Edit the surname (for display in the menu)
ar: تعديل اسم العائلة (يظهر في القائمه)

source: Error: An individual with ID %s doesn’t exist in this tree.
ar: خطأ: لا يوجد شخص بالمعرف %s في هذه العائلة.

source: Error: The root person belonging to this surname already exists
ar: خطأ: الرأس الذي ينتمي الى هذه العائلة موجود مسبقا.

source: Error: The root person you are trying to add already exists
ar: خطأ: الرأس الذي تحاول اضافته موجود مسبقا.

source: Error: The root person you are trying to add has no partner and/or children. It is not possible to set this individual as root person.
ar: خطأ: الشخص الذي تحاول ان تجعلة رأسا لا يملك زوجا او اطفالا. لا يمكن استخدام هذا الشخص كرأس.

source: Error: The surname you entered doesn’t exist in this tree.
ar: خطأ: اسم العائلة الذي ادخلته غير موجود في الشجرة.

source: General Options
ar: خيارات التكوين

source: Go
ar: نفذ

source: He married %s times
ar: تزوج لي %s مرات

# PAST
source: He was born
ar: ولد

# PRESENT
source: He was born
ar: ولد

source: Number of generation blocks to show
ar: عدد الاجيال المراد عرضها

source: Or manually add a root person
ar: او قم بأضافته رأس الشجره يديويا

source: PDF not supported for RTL-languages
ar: الـPDF لا يدعم لغات اليمين الى اليسار

source: Root person
ar: الشخص الرئيسي

source: Select your country
ar: اختر بلدك

source: She married %s times
ar: تزوجت لي %s مرات

# PAST
source: She was born
ar: ولدت

# PRESENT
source: She was born
ar: ولدت

source: Show PDF icon?
ar: اظهار ايقونه تكوين الـPDF ؟

source: Show form to change start person
ar: أظهار امكانية تغيير رأس الشجرة

source: Show occupations
ar: أظهار الوضائف

source: Show places?
ar: أظهار الأماكن؟

source: Show single persons
ar: أظهار الاشخاص المنفردين

source: The %s time he married
ar: في زواجه الـ %s

source: The %s time she married
ar: في زواجها الـ %s

source: The details of this generation are private.
ar: تفاصيل هذا الجيل خاصة

source: The pdf contains only visible generation blocks.
ar: ملف الـpdf يحوي على الاجيال الظاهرة فقط

source: The settings will be reset to default (for all trees). Are you sure you want to do this?
ar: سيتم اعادة ضبط جميع الاعدادات لكل المشجرات، هل انت متأكد من انك تريد فعل ذالك؟

source: Thumbnail size
ar: حجم الصورة المصغرة

source: Tree view
ar: شجرة الأجيال

source: Use fullname in menu
ar: أستخدم الاسم الكامل في القائمة

source: Use square thumbnails
ar: استخدام صوره مصغره

source: and
ar: و

# age in days/months
source: at the age of %s
ar: بعمر %s

# age in years
source: at the age of %s
ar: بعمر %s

# FEMALE
source: died
ar: توفيت

# MALE
source: died
ar: توفي

source: fifth
ar: الخامس

source: first
ar: الاول

source: follow
ar: تعقب

source: fourth
ar: الرابع

# One parent/multiple children
source: had
ar: لديه

# One parent/one child
source: had
ar: لديه

# Two parents/multiple children
source: had
ar: لديه

# Two parents/one child
source: had
ar: لديه

# before dateformat mmm yyyy
source: in
ar: في

# before dateformat yyyy
source: in
ar: في

# before placesnames
source: in
ar: في

# before dateformat dd-mm-yyyy
source: on
ar: في

source: second
ar: الثاني

source: third
ar: الثالث

# PAST (FEMALE)
source: was born
ar: ولدت

# PAST (MALE)
source: was born
ar: ولد

# PRESENT (FEMALE)
source: was born
ar: ولدت

# PRESENT (MALE)
source: was born
ar: ولد

source: were divorced
ar: أنفصلا
